; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v4 - type_1)
 	      (pred_1 ?v5 - object ?v4 - type_1)
	      (pred_3 ?v6 - type_2 ?v1 - type_3)
	      (pred_2 ?v6 - type_2 ?v5 - object ?v1 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v7 ?v3 - type_1)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v3)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_2 ?v2 - object ?v8 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v8) (pred_4 ?v6 ?v8) (pred_3 ?v6 ?v1))
       :effect (and (pred_2 ?v6 ?v2 ?v1)
		    (not (pred_1 ?v2 ?v8)) 
		    (not (pred_3 ?v6 ?v1))))

   (:action op_1
       :parameters (?v6 - type_2 ?v2 - object ?v8 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v2 ?v1) (pred_4 ?v6 ?v8))
       :effect (and (pred_1 ?v2 ?v8)
		    (pred_3 ?v6 ?v1)
		    (not (pred_2 ?v6 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_03 obj_04 - type_2
obj_13 obj_12 obj_02 obj_10 - type_3
obj_01 obj_11 obj_09 obj_05 - type_1
obj_08 obj_06 obj_07 - object)
(:init
(pred_4 obj_03 obj_09)
(pred_3 obj_03 obj_13)
(pred_3 obj_03 obj_12)
(pred_4 obj_04 obj_05)
(pred_3 obj_04 obj_02)
(pred_3 obj_04 obj_10)
(pred_1 obj_08 obj_05)
(pred_1 obj_06 obj_05)
(pred_1 obj_07 obj_09)
)
(:goal
(and
(pred_1 obj_08 obj_01)
(pred_1 obj_06 obj_05)
(pred_1 obj_07 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_03 obj_11)))
)
)

; plan
1. (op_3 obj_04 obj_08 obj_05 obj_10)
   deleted: (pred_1 obj_08 obj_05) (pred_3 obj_04 obj_10)
   added: (pred_2 obj_04 obj_08 obj_10)
   goals met: 1 of 3
2. (op_3 obj_03 obj_07 obj_09 obj_12)
   deleted: (pred_1 obj_07 obj_09) (pred_3 obj_03 obj_12)
   added: (pred_2 obj_03 obj_07 obj_12)
   goals met: 1 of 3
3. (op_2 obj_04 obj_05 obj_01)
   deleted: (pred_4 obj_04 obj_05)
   added: (pred_4 obj_04 obj_01)
   goals met: 1 of 3
4. (op_2 obj_03 obj_09 obj_01)
   deleted: (pred_4 obj_03 obj_09)
   added: (pred_4 obj_03 obj_01)
   goals met: 1 of 3
5. (op_1 obj_04 obj_08 obj_01 obj_10)
   deleted: (pred_2 obj_04 obj_08 obj_10)
   added: (pred_1 obj_08 obj_01) (pred_3 obj_04 obj_10)
   goals met: 2 of 3
6. (op_1 obj_03 obj_07 obj_01 obj_12)
   deleted: (pred_2 obj_03 obj_07 obj_12)
   added: (pred_1 obj_07 obj_01) (pred_3 obj_03 obj_12)
   goals met: 2 of 3
7. (op_3 obj_04 obj_07 obj_01 obj_10)
   deleted: (pred_1 obj_07 obj_01) (pred_3 obj_04 obj_10)
   added: (pred_2 obj_04 obj_07 obj_10)
   goals met: 2 of 3
8. (op_2 obj_04 obj_01 obj_11)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_11)
   goals met: 2 of 3
9. (op_1 obj_04 obj_07 obj_11 obj_10)
   deleted: (pred_2 obj_04 obj_07 obj_10)
   added: (pred_1 obj_07 obj_11) (pred_3 obj_04 obj_10)
   goals met: 3 of 3
